positron96/LocoNetControlStation/lib/DCC/ESP32SignalGenerator.cpp
#include "ESP32SignalGenerator.h"

namespace dcc {


//char _msg[1024];
//char _buf[100];
/*
void ESP32TimerChannel::PacketSlot::initPackets(){
    activePacket = packet;
    updatePacket = packet+1;
} */


static DCCESP32SignalGenerator * _inst = nullptr;


void IRAM_ATTR timerCallback() {
    _inst->timerFunc();
}

void adcTimerCallback(void* arg) {
    ((DCCESP32SignalGenerator*)arg)->adcTimerFunc();
}


DCCESP32SignalGenerator::DCCESP32SignalGenerator(uint8_t timerNum)
    : _timerNum(timerNum)
{
    _inst = this;
}

void DCCESP32SignalGenerator::begin() {
    if (main!=nullptr) main->begin();
    if (prog!=nullptr) prog->begin();

    (void)_timerNum;
    _timer = timerBegin(1000000 / 58); // 58us
    timerAttachInterrupt(_timer, timerCallback);
    timerAlarm(_timer, 10, true, 0);
    timerStart(_timer);

    esp_timer_create_args_t cfg{adcTimerCallback, this, ESP_TIMER_TASK, "adc"};
    esp_timer_create(&cfg, &_adcTimer);
    esp_timer_start_periodic(_adcTimer, 1000);  // 1ms
}

void DCCESP32SignalGenerator::end() {
    if(_timer!=nullptr) {
        timerStop(_timer);
        timerEnd(_timer);
        _timer = nullptr;
    }
    esp_timer_stop(_adcTimer);
    esp_timer_delete(_adcTimer);
    if (main!=nullptr) main->end();
    if (prog!=nullptr) prog->end();
}

void DCCESP32SignalGenerator::timerFunc() {

    if (main!=nullptr) main->timerFunc();
    if (prog!=nullptr) prog->timerFunc();

}

void DCCESP32SignalGenerator::adcTimerFunc() {
    if (main!=nullptr) main->updateCurrent();
    if (prog!=nullptr) prog->updateCurrent();
}

}
